turbulent_wedge/turbulent_wedge_kO/turbulent_wedge_kO_noWF/turbulent_wedge_kO_noWF_low_l/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 7.5;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
	//To disable wall function - Does not get the profile
        //type            fixedValue;
        //value           uniform 1e-12;
        //value           $internalField;

	//LRN-HRN - To enable wall function - Requires less iter to get profile
        type            omegaWallFunction;
        value           $internalField;
        value           uniform 10000;
    }

    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}

// ************************************************************************* //
